app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 9)

  def create
    @comment = Comment.new(params[:comment])
    @proposal = Proposal.find(params[:regards_proposal_id])
    @comment.regards_proposal = @proposal
    @comment.owner = current_user

    respond_to do |format|
      if @comment.save
---
SELECT * FROM `proposals` WHERE (`proposals`.`id` = 7)
INSERT INTO `comments` (`updated_at`, `text`, `modified_at`, `owner_id`, `regards_proposal_id`, `created_at`) VALUES('2008-12-11 18:49:43', 'asdasd', NULL, 2, 9, '2008-12-11 18:49:43')

  def update
    @comment = Comment.find(params[:id])

    unless @comment.owner.id == current_user.id
      redirect_to intruder_path
      return
    end

    original_text = @comment.text

    respond_to do |format|
      if @comment.update_attributes(params[:comment])
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 11)
UPDATE `comments` SET `text` = 'Det trenger Det trenger Det trenger Det trenger Det trenger Det trenger Det trenger \r\n', `updated_at` = '2008-12-11 13:08:00' WHERE `id` = 11

  def destroy
    @comment = Comment.find(params[:id])
    unless @comment.owner.id == current_user.id
      redirect_to intruder_path
      return
    end

    @comment.destroy
---
SELECT * FROM `comments` WHERE (`comments`.`id` = 11)
DELETE FROM `comments` WHERE `id` = 11