app/controllers/proposals_controller.rb

SELECT * FROM `proposals` WHERE (`proposals`.company_id = 3) ORDER BY id desc LIMIT 0, 10
SELECT count(*) AS count_all FROM `proposals`
---
  def index
    @proposals = current_user.company.proposals.paginate :order => 'id desc', :page => params[:page], :per_page =>10

SELECT * FROM `proposals` WHERE (`proposals`.`id` = 1)
SELECT * FROM `comments` WHERE (`comments`.regards_proposal_id = 30) ORDER BY id LIMIT 0, 10
SELECT count(*) AS count_all FROM `comments` WHERE (`comments`.regards_proposal_id = 7)
---
  def show
    @proposal = Proposal.find(params[:id])
    unless proposal_can_be_shown_to_current_user(@proposal)
      redirect_to intruder_path
      return
    end
    @comments = @proposal.comments.paginate :order => 'id', :page => params[:page], :per_page =>10

SELECT * FROM `proposals` WHERE (`proposals`.`id` = 4)
---
  def edit
    @proposal = Proposal.find(params[:id])

INSERT INTO `proposals` (`updated_at`, `modified_at`, `customer_requirement`, `owner_id`, `company_id`, `suggested_solution`, `created_at`) VALUES('2008-12-18 13:58:05', NULL, 'Earn (more) money', 1, 3, 'Be smart', '2008-12-18 13:58:05')
---
  def create
    @proposal = Proposal.new(params[:proposal])
    @proposal.owner = current_user
    @proposal.company = current_user.company
    logger.debug("Owner is #{@proposal.owner}")

    if @proposal.save

SELECT * FROM `proposals` WHERE (`proposals`.`id` = 4)
UPDATE `proposals` SET `customer_requirement` = 'Bladibladi boo bang biBladibladi boo bang biBladibladi boo bang biBladibladi boo bang bi\r\nSida dada lola li\r\n\r\nBuuu', `updated_at` = '2008-12-11 08:52:39' WHERE `id` = 5
---
  def update
    @proposal = Proposal.find(params[:id])

    unless @proposal.owner.id == current_user.id
      redirect_to intruder_path
      return
    end

    orig_customer_requirement = @proposal.customer_requirement
    orig_suggested_solution = @proposal.suggested_solution

    if @proposal.update_attributes(params[:proposal])

SELECT * FROM `proposals` WHERE (`proposals`.`id` = 4)
DELETE FROM `proposals` WHERE `id` = 8
---
  def destroy
    @proposal = Proposal.find(params[:id])

    unless @proposal.owner.id == current_user.id
      redirect_to intruder_path
      return
    end

    @proposal.destroy