app/controllers/users_controller.rb

  def show
    if user_logged_in?
      redirect_to :controller=>"Proposals", :action=>"index"
      return
    end

    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)