app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`email` = 'tjhubertz@gmail.com') LIMIT 1
UPDATE `users` SET `token` = '6e0859b8225b98ae2ebb8b18ec1893bfa499c5857b5f0f14929662e929b1fd8684b94c0f87015e6b21e6a2fa9e3631e02e63', `updated_at` = '2008-12-10 18:11:39' WHERE `id` = 1
INSERT INTO `users` (`updated_at`, `token`, `admin`, `company_id`, `email`, `created_at`) VALUES('2008-12-18 12:45:31', 'b663ec53774e7e6602cb6bd0955bed865ad2d8dca88e708c1e32982d853c594cc5ecd5ab4c7ba948fccb3064a8a3af4fcb41', 0, 2, 'testme@online.no', '2008-12-18 12:45:31')
---
  def create
    @user = User.new(params[:user])

    @email_format = Regexp.new(/^([^@\s]+)@((?:[-a-z0-9]+\.)+[a-z]{2,})$/)

    unless @email_format.match(@user.email)
      flash.now[:alert] = "Ikke en gyldig epostaddresse"
      render :action=>"new"
      return
    end


    token = generate_token

    existing_user = User.find_by_email(@user.email)
    if existing_user !=nil
      existing_user.token = token
      existing_user.save
      send_token_email_to_existing_user existing_user
      flash[:notice] = "Epost med lenke for å logge seg inn er sendt til #{existing_user.email}"

    else
      @user.token = token
      @user.company = find_company(@user.email)
      if is_admin(@user.email)
        @user.admin = true
      else
        @user.admin = false
      end
      logger.debug("the company #{@user.company}")
      if @user.save

SELECT * FROM `companies` WHERE (`companies`.`domain` = 'online.no') LIMIT 1
SELECT * FROM `companies` WHERE (`companies`.`name` = 'Demo') LIMIT 1
---
  def find_company(email)
    @company= Company.find_by_domain(get_domain(email))
    unless @company
      @company = Company.find_by_name('Demo')

SELECT * FROM `companies` WHERE (`companies`.`id` = 3)
---
  def set_company
    if current_user.admin
      company = Company.find(params[:company_id])